# HyperYOLO object detection model with N3-N5 outputs.

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants,
  # [depth, width, max_channels, threshold]
  t: [0.33, 0.25, 1024, 6]

# backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-B1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1
  - [-1, 3, C2f, [128, True]] # 2-B2/4
  - [-1, 1, Conv, [256, 3, 2]]  # 3
  - [-1, 6, MANet, [256, True, 1, 3]] # 4-B3/8
  - [-1, 1, Conv, [512, 3, 2]]  # 5
  - [-1, 6, MANet, [512, True, 1, 3]] # 6-B4/16
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9-B5/32

# head
head:
 # Semantic Collecting
 - [0, 1, nn.AvgPool2d, [8, 8, 0]] # 10
 - [2, 1, nn.AvgPool2d, [4, 4, 0]] # 11
 - [4, 1, nn.AvgPool2d, [2, 2, 0]] # 12
 - [9, 1, nn.Upsample, [None, 2, 'nearest']] # 13
 - [[10, 11, 12, 6, 13], 1, Concat, [1]]  # cat 14

 # Hypergraph Computation
 - [-1, 1, Conv, [512, 1, 1]] # 15
 - [-1, 1, HyperComputeModule, [512]] # 16
 - [-1, 3, MANet, [512, True]] # 17

 # Semantic Scattering
 - [-1, 1, nn.AvgPool2d, [2, 2, 0]] # 18
 - [[-1, 9], 1, Concat, [1]]  # cat 19
 - [-1, 1, Conv, [1024, 1, 1]] # 20

 - [[17, 6], 1, Concat, [1]]  # cat 21
 - [-1, 3, C2f, [512, False]]  # 22

 - [17, 1, nn.Upsample, [None, 2, 'nearest']] # 23
 - [[-1, 4], 1, Concat, [1]]  # cat 24
 - [-1, 3, C2f, [256, False]]  # 25

 - [-1, 1, Conv, [256, 3, 2]] # 26
 - [[-1, 22], 1, Concat, [1]]  # 27 cat 
 - [-1, 3, C2f, [512, False]]  # 28

 - [-1, 1, Conv, [512, 3, 2]] # 29
 - [[-1, 20], 1, Concat, [1]]  # 30 cat 
 - [-1, 1, Conv, [1024, 1, 1]]  # 31

 - [[25, 28, 31], 1, Detect, [nc]]  # Detect(N3, N4, N5)
